//Laboratory work
//written by student of the first curse
//of the group IC-52
//Anton Doroshenko
//2015.10.01
//==========================================================================

#include <iostream>  // бібліотека потоків вводу-виводу
using namespace std; // простір стандартних імен

int main()           // головна функція

{

	float y, x, b, c;// оголошення змінних

	cout << "Lab_2, IS-52, variant 9, made by Anton Doroshenko " << endl;// виведення повідомлення
	cout << "calculate expression" << endl;                              // виведення повідомлення
	cout << "if x > 0 and b = c, y = (1 - x)/(1 + x)" << endl;           // умова задачі
	cout << "if x > 0 and b != c, y = (2 * x^2)/(b - c)" << endl;
	cout << "if x < 0, y = x^2 * (b + c)" << endl;
	cout << "enter x, b, c" << endl;                                     // виведення повідомлення
	cin >> x >> b >> c;                                                  // введення данних 
	if (x == 0)                              // умова виконується, якщо змінній х надано значення 0 
	{
		cout << "Function is undefined if x = 0" << endl;// виведення повідомлення
		system("pause");                     // затримка екрана консоли
		exit(1);                             // переривання програми
	}                                        // кінець гілки х == 0
	else if (x > 0)                          //умова виконується, якщо змінній х надано значення більше 0
	{
		if (b == c)  /* умова виконується, якщо змінній х надано значення більше 0 
				        і змінним b, c надано однакових значеннь */
		{
			y = (1 - x) / (1 + x);          // обчислення першого виразу
		}                                   // кінець гілки b == c
		else y = (2 * x * x) / (b - c);     // b != c, обчислення другого виразу
	}                                       // кінець гілки х > 0
	else y = (b + c) * x * x;               // x < 0, обчислення третього виразу

	cout << "result :" << y << endl;        // виведення результату
	system("pause");                        // затримка екрана консолі

}